content/imported/tutorials/partitioned-pipe/fluid1-openfoam-pimplefoam/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol 	         1.0e-3;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
        minIter         2;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors 3;
    nNonOrthogonalCorrectors 1;
    momentumPredictor true; 
    nOuterCorrectors	2;
}
